[
  {
    "title": "Paneles solares de alta eficiencia (2000–actualidad)",
    "description": "Avances en materiales fotovoltaicos como el silicio monocristalino y las perovskitas permitieron que los paneles solares sean más eficientes y baratos, impulsando la ingeniería energética y la transición hacia energías renovables.",
    "link": "https://es.wikipedia.org/wiki/Charles_Fritts",
    "thumbnail": "/img/inventos/1.png",
    "creator": "Charles Fritts",
    "creatorSlug": "charles-fritts",
    "photo": "/img/inventores/charlesfritts.webp",
    "purpose": "Desarrollados para aprovechar la energía solar de manera más eficiente y económica, contribuyendo a la lucha contra el cambio climático y reduciendo la dependencia de combustibles fósiles. Los avances en tecnología fotovoltaica buscan hacer la energía renovable accesible para todos, desde hogares individuales hasta grandes instalaciones industriales. El objetivo principal es convertir la luz solar en electricidad limpia, económica y sostenible, permitiendo a comunidades enteras reducir su huella de carbono mientras disminuyen sus costos energéticos a largo plazo.",
    "additionalInfo": "La eficiencia de los paneles solares ha experimentado un crecimiento extraordinario, pasando del 15% en los años 2000 al 22-26% en la actualidad, con tecnologías emergentes como las perovskitas prometiendo alcanzar eficiencias superiores al 30%. China lidera la producción mundial con más del 70% del mercado global. La ingeniería de materiales continúa innovando con células tándem que combinan múltiples capas de semiconductores para capturar diferentes longitudes de onda de luz, y tecnologías bifaciales que capturan luz por ambos lados del panel, aumentando la generación hasta en un 30%. Los nuevos diseños incluyen paneles flexibles, integración arquitectónica (BIPV), y sistemas de seguimiento solar que optimizan el ángulo de inclinación durante el día.",
    "impact": "La revolución solar ha logrado una reducción del 89% en el costo de la energía solar desde 2010, haciendo que sea la fuente de energía más económica en muchas regiones del mundo. La capacidad instalada global supera los 1,000 GW y continúa creciendo exponencialmente. Ha generado millones de empleos verdes en instalación, mantenimiento, investigación y desarrollo. Países como Alemania, China e India han implementado programas masivos de energía solar, mientras que en áreas remotas sin acceso a la red eléctrica, los paneles solares han llevado electricidad a comunidades enteras. La tecnología ha permitido la electrificación de sistemas de transporte, bombeo de agua en zonas agrícolas, y alimentación de dispositivos IoT para ciudades inteligentes.",
    "images": ["", "", ""]

  },
  {
    "title": "Bitcoin (2009)",
    "description": "Primera criptomoneda descentralizada basada en blockchain, creada por Satoshi Nakamoto. Introdujo un sistema de registro digital seguro y sin intermediarios, cambiando la ingeniería de software y seguridad informática.",
    "link": "https://es.wikipedia.org/wiki/Satoshi_Nakamoto",
    "thumbnail": "/img/inventos/2.png",
    "creator": "Satoshi Nakamoto (seudónimo, identidad desconocida)",
    "creatorSlug": "satoshi-nakamoto",
    "photo": "/img/inventores/satoshinakamoto.jpg",
    "purpose": "Creado como respuesta directa a la crisis financiera de 2008 para establecer un sistema de dinero electrónico peer-to-peer completamente descentralizado, sin necesidad de bancos, gobiernos o instituciones financieras centralizadas que puedan controlar o manipular el sistema monetario. Bitcoin garantiza privacidad, seguridad y transparencia mediante criptografía avanzada, permitiendo que cualquier persona en el mundo pueda enviar y recibir valor sin intermediarios, censura o fronteras. Su creación representó un experimento social y tecnológico para devolver el control del dinero a los individuos.",
    "additionalInfo": "Bitcoin utiliza tecnología blockchain, un libro contable distribuido e inmutable que registra todas las transacciones de forma transparente y verificable por cualquier persona. El proceso de 'minería' requiere que computadoras resuelvan complejos problemas matemáticos criptográficos para validar transacciones y crear nuevos bitcoins, garantizando la seguridad de la red. Existe un límite máximo de 21 millones de bitcoins que jamás existirán, lo que lo convierte en un activo deflacionario. La red procesa aproximadamente 7 transacciones por segundo y consume energía equivalente a países pequeños, aunque cada vez más mineros utilizan energías renovables. Cada transacción es confirmada por miles de nodos distribuidos globalmente, haciendo prácticamente imposible su alteración o hackeo.",
    "impact": "Bitcoin alcanzó una capitalización de mercado superior al billón de dólares, estableciéndose como 'oro digital' y reserva de valor. Inspiró la creación de más de 20,000 criptomonedas y tokens alternativos. El Salvador lo adoptó como moneda legal en 2021, convirtiéndose en el primer país en hacerlo. Revolucionó conceptos fundamentales como descentralización, contratos inteligentes, finanzas digitales (DeFi), y tokenización de activos. Ha permitido a millones de personas en países con economías inestables proteger sus ahorros de la inflación y la devaluación. Instituciones como Tesla, MicroStrategy y fondos de inversión tradicionales ahora mantienen Bitcoin en sus balances. La tecnología blockchain derivada de Bitcoin se utiliza en cadenas de suministro, registros médicos, sistemas de votación y verificación de identidad digital.",
    "images": ["", "", ""]
  },
  {
    "title": "ChatGPT (2022)",
    "description": "Modelo de inteligencia artificial generativa desarrollado por OpenAI. Utiliza redes neuronales avanzadas para comprender y generar texto, transformando la ingeniería de software, la educación y los procesos de automatización.",
    "link": "https://es.wikipedia.org/wiki/Sam_Altman",
    "thumbnail": "/img/inventos/3.png",
    "creator": "OpenAI (Sam Altman, Greg Brockman y equipo)",
    "creatorSlug": "sam-altman",
    "photo": "/img/inventores/samaltman.webp",
    "purpose": "Desarrollado para crear un asistente de inteligencia artificial conversacional revolucionario, capaz de entender contexto complejo, razonar, y generar texto de manera coherente, natural y útil en prácticamente cualquier tema. El objetivo fundamental es democratizar completamente el acceso a la inteligencia artificial avanzada, permitiendo que estudiantes, profesionales, investigadores y empresas de cualquier tamaño puedan beneficiarse de capacidades que antes requerían equipos especializados y recursos multimillonarios. ChatGPT busca ser un amplificador de la inteligencia humana, ayudando en educación, programación, creatividad, investigación, resolución de problemas y productividad general.",
    "additionalInfo": "Basado en la arquitectura GPT (Generative Pre-trained Transformer), un modelo de lenguaje entrenado con cientos de miles de millones de parámetros utilizando vastas cantidades de texto de internet, libros, artículos científicos y conversaciones. GPT-4, lanzado en 2023, incorporó capacidades multimodales permitiéndole procesar imágenes, analizar gráficos y generar código funcional. Utiliza aprendizaje por refuerzo con retroalimentación humana (RLHF) para alinear sus respuestas con valores humanos y mejorar su utilidad. Alcanzó 100 millones de usuarios activos en solo 2 meses, el crecimiento más rápido jamás registrado en la historia de las aplicaciones de consumo. La arquitectura transformer revolucionó el procesamiento de lenguaje natural mediante mecanismos de atención que permiten comprender relaciones complejas entre palabras y conceptos.",
    "impact": "ChatGPT transformó radicalmente la productividad en programación (generación automática de código, debugging, documentación), escritura creativa, análisis de datos, traducción y educación personalizada. Aceleró exponencialmente la adopción de IA generativa en empresas de todos los tamaños, desde startups hasta corporaciones Fortune 500. Generó debates cruciales sobre ética de IA, desinformación, derechos de autor, desplazamiento laboral y el futuro del trabajo humano. Impulsó inversiones masivas superiores a $100 mil millones en 2023 en desarrollo de IA. Ha democratizado la creación de contenido, permitiendo a personas sin formación técnica crear aplicaciones, analizar información compleja y automatizar tareas cognitivas. Instituciones educativas están redefiniendo sus métodos de enseñanza y evaluación. Microsoft integró GPT en Office, GitHub Copilot revolucionó la programación, y miles de empresas desarrollaron aplicaciones basadas en la API de OpenAI.",
    "images": ["", "", ""]
  },
  {
    "title": "Computación en la nube (2006)",
    "description": "Con el lanzamiento comercial de Amazon Web Services, se vuelve posible acceder a servidores y almacenamiento remoto, revolucionando el desarrollo y despliegue de software e infraestructura TI.",
    "link": "https://en.wikipedia.org/wiki/Andy_Jassy",
    "thumbnail": "/img/inventos/4.png",
    "creator": "Amazon Web Services (AWS) - liderado por Andy Jassy",
    "creatorSlug": "andy-jassy",
    "photo": "/img/inventores/andyjassy.jpg",
    "purpose": "Creada para revolucionar completamente la forma en que empresas e individuos acceden, utilizan y pagan por recursos computacionales, permitiendo acceso bajo demanda a servidores, almacenamiento, bases de datos y servicios avanzados sin necesidad de construir, mantener o actualizar infraestructura física costosa. El objetivo es democratizar el acceso a tecnología empresarial de nivel mundial, permitiendo que una startup en un garaje tenga acceso a la misma infraestructura que las corporaciones más grandes, pagando solo por lo que utiliza. La computación en la nube elimina barreras de entrada, reduce costos operativos dramáticamente y permite innovación ágil y escalable.",
    "additionalInfo": "AWS revolucionó la industria lanzando EC2 (Elastic Compute Cloud) para servidores virtuales y S3 (Simple Storage Service) para almacenamiento masivo en 2006. La plataforma permite escalar recursos computacionales instantáneamente según la demanda, desde un solo servidor hasta miles simultáneamente. Ofrece modelos de pago por uso en múltiples niveles: IaaS (infraestructura como servicio), PaaS (plataforma como servicio) y SaaS (software como servicio). Microsoft Azure (2010) y Google Cloud Platform (2011) siguieron, creando un mercado competitivo. La nube híbrida moderna combina infraestructura local (on-premise) con la nube pública, ofreciendo flexibilidad y control. Los servicios actuales incluyen machine learning, análisis de big data, IoT, blockchain, computación cuántica, bases de datos administradas, redes de distribución de contenido (CDN), y servicios serverless que eliminan completamente la gestión de servidores.",
    "impact": "El mercado global de computación en la nube superó los $500 mil millones anuales y continúa creciendo a tasas de dos dígitos. Permitió que startups compitan con corporaciones establecidas con inversión mínima inicial, democratizando la innovación tecnológica. Facilitó la transición masiva al trabajo remoto durante la pandemia, manteniendo la continuidad empresarial global. Servicios como Netflix (streaming para 200+ millones de usuarios), Spotify, Airbnb, Uber y millones de aplicaciones modernas dependen completamente de la nube. Empresas tradicionales migraron operaciones críticas, reduciendo costos de TI entre 30-60%. Ha permitido el procesamiento de big data, entrenamiento de modelos de IA masivos, y análisis en tiempo real que serían imposibles con infraestructura tradicional. Generó millones de empleos en ingeniería cloud, arquitectura de soluciones y DevOps. Gobiernos y universidades utilizan la nube para investigación científica, simulaciones climáticas y análisis genómico.",
    "images": ["", "", ""]
  },
  {
    "title": "Smartphone (2007)",
    "description": "El iPhone introduce la era de los teléfonos inteligentes con pantalla táctil y acceso a Internet, fusionando la ingeniería electrónica, de software y telecomunicaciones en un solo dispositivo.",
    "link": "https://es.wikipedia.org/wiki/Steve_Jobs",
    "thumbnail": "/img/inventos/5.jpg",
    "creator": "Apple Inc. - Steve Jobs, Jony Ive y equipo de ingeniería",
    "creatorSlug": "steve-jobs",
    "photo": "/img/inventores/stevejobs.jpg",
    "purpose": "Diseñado para revolucionar completamente la telefonía móvil y la computación personal, combinando tres dispositivos esenciales en uno solo: un reproductor de música iPod de pantalla ancha, un teléfono móvil revolucionario y un dispositivo de Internet de avanzada. La visión era crear una interfaz táctil tan intuitiva que cualquier persona pudiera usarla sin manual de instrucciones, eliminando por completo la necesidad de teclados físicos, stylus o botones complejos. Steve Jobs quería 'reinventar el teléfono' y crear un dispositivo que la gente amara usar, no solo tolerara.",
    "additionalInfo": "El iPhone original (2007) presentaba una pantalla táctil capacitiva revolucionaria de 3.5 pulgadas multi-touch, 128 MB de RAM, procesador ARM a 412 MHz y iOS como sistema operativo completamente nuevo. La verdadera revolución llegó en 2008 con el lanzamiento de la App Store, creando un ecosistema completo donde desarrolladores independientes podían crear y vender aplicaciones, generando una economía digital masiva. Android fue lanzado por Google en 2008 como competencia directa, democratizando los smartphones. Los dispositivos modernos integran decenas de sensores: GPS para navegación precisa, cámaras con IA, acelerómetro, giroscopio, brújula digital, sensores de proximidad, Face ID, reconocimiento de huellas, NFC para pagos, LiDAR para realidad aumentada, y chips de procesamiento neural dedicados.",
    "impact": "Más de 6.8 mil millones de personas utilizan smartphones globalmente, convirtiéndolos en el dispositivo más ubicuo de la historia humana. Creó industrias completas de trillones de dólares: desarrollo de apps móviles, comercio electrónico móvil, redes sociales móviles, banca móvil, educación móvil. La economía de aplicaciones genera más de $400 mil millones anuales. Cambió radicalmente la fotografía (miles de millones de fotos diarias), navegación (reemplazando GPS dedicados), comunicación (WhatsApp, videollamadas), acceso a información, entretenimiento, trabajo remoto y prácticamente todos los aspectos de la vida moderna. Ha democratizado el acceso a internet en países en desarrollo, permitiendo inclusión financiera mediante mobile banking, y transformado la educación con acceso instantáneo al conocimiento humano.",
    "images": ["", "", ""]
  },
  {
    "title": "Impresora 3D (2005–2010)",
    "description": "Permite fabricar objetos capa por capa a partir de modelos digitales. Ha transformado la manufactura, medicina y prototipado gracias a su precisión y versatilidad.",
    "link": "https://en.wikipedia.org/wiki/Chuck_Hull",
    "thumbnail": "/img/inventos/6.png",
    "creator": "Chuck Hull (estereolitografía, 1984), popularizada comercialmente por MakerBot (2009) y otros",
    "creatorSlug": "chuck-hull",
    "photo": "/img/inventores/chuckhull.jpg",
    "purpose": "Desarrollada para revolucionar la manufactura tradicional mediante fabricación aditiva, permitiendo crear objetos físicos complejos capa por capa directamente desde modelos digitales 3D. El objetivo es eliminar las limitaciones de la producción en masa, permitiendo personalización extrema, reducción dramática de desperdicios de material, prototipado ultra-rápido, y fabricación de geometrías imposibles con métodos tradicionales como moldeo o mecanizado. La impresión 3D democratiza la manufactura, permitiendo que diseñadores, ingenieros, médicos y makers creen productos customizados bajo demanda sin necesidad de fábricas costosas o mínimos de producción.",
    "additionalInfo": "Chuck Hull inventó la estereolitografía (SLA) en 1984, pero la tecnología fue popularizada comercialmente en los 2000s por empresas como MakerBot (2009) y otros fabricantes que hicieron las impresoras accesibles. Tecnologías principales incluyen: FDM (Fused Deposition Modeling) que funde filamento plástico, SLA (Stereolithography) que usa luz UV para curar resina líquida, SLS (Selective Laser Sintering) que fusiona polvo con láser, y DMLS para metales. Los materiales disponibles van desde plásticos básicos (PLA, ABS) hasta metales de grado aeroespacial (titanio, aluminio, acero inoxidable), resinas biocompatibles, cerámicas, e incluso biotintas con células vivas para bioimpresión de tejidos. La resolución puede alcanzar 16 micrones (más fino que un cabello humano). La impresión 4D emergente usa materiales inteligentes que cambian forma, color o propiedades con el tiempo en respuesta a estímulos como temperatura, luz o humedad.",
    "impact": "El mercado global alcanzó $18 mil millones en 2023 y crece exponencialmente. En medicina, revolucionó el tratamiento con prótesis personalizadas perfectamente ajustadas a cada paciente, modelos anatómicos pre-quirúrgicos para planificación compleja, implantes de titanio customizados, bioimpresión de tejidos y órganos experimentales, y férulas personalizadas. La industria aeroespacial y automotriz reduce el peso de piezas críticas hasta 60% mediante diseños imposibles con manufactura tradicional, ahorrando combustible masivamente. Se han construido casas completas en menos de 24 horas usando impresión 3D de concreto. Democratizó la manufactura para pequeños negocios, emprendedores y el movimiento maker, permitiendo producción local bajo demanda sin inventarios ni desperdicio de material.",
    "images": ["", "", ""]
  },
  {
    "title": "Vehículo eléctrico moderno (2008–actualidad)",
    "description": "Con Tesla y otras marcas, los autos eléctricos se vuelven comerciales. Integran ingeniería eléctrica, mecánica y software para movilidad inteligente y sostenible.",
    "link": "https://es.wikipedia.org/wiki/Elon_Musk",
    "thumbnail": "/img/inventos/7.jpg",
    "creator": "Tesla Motors - Elon Musk, Martin Eberhard, Marc Tarpenning y equipo",
    "creatorSlug": "elon-musk",
    "photo": "/img/inventores/elonmusk.webp",
    "purpose": "Desarrollados para ofrecer transporte completamente libre de emisiones contaminantes, reducir radicalmente la dependencia global del petróleo y demostrar de manera irrefutable que los vehículos eléctricos no solo son viables, sino que pueden ser dramáticamente superiores a los de combustión interna en rendimiento, aceleración, tecnología, costos operativos y sostenibilidad ambiental. La misión de Tesla específicamente era acelerar la transición mundial hacia energía sostenible, destruyendo el mito de que los autos eléctricos eran lentos, aburridos y poco prácticos. El objetivo final es eliminar completamente los combustibles fósiles del transporte terrestre.",
    "additionalInfo": "El Tesla Roadster (2008) fue el primer vehículo eléctrico de producción masiva con baterías de ion-litio de alta densidad energética y autonomía superior a 200 millas, demostrando que los EVs podían ser deportivos y emocionantes. El Model S (2012) estableció nuevos estándares de lujo eléctrico con aceleración 0-60mph en 2.5 segundos. La tecnología incluye: motores eléctricos síncronos de imanes permanentes con eficiencia superior al 90% (vs ~30% de motores de combustión), packs de baterías con miles de celdas de ion-litio, regeneración de energía en frenado que recarga las baterías, sistemas de piloto automático con cámaras, radar y IA, actualizaciones over-the-air que mejoran el vehículo continuamente, y arquitectura eléctrica de 400-800 voltios. Los EVs tienen menos de 20 partes móviles vs 2,000+ en motores de combustión, reduciendo mantenimiento drásticamente.",
    "impact": "Las ventas globales de vehículos eléctricos superaron 10 millones de unidades en 2022, con crecimiento anual del 60%+. Reducción dramática de emisiones: un EV emite 50-70% menos CO2 durante su ciclo de vida completo, incluso considerando la generación eléctrica. Los costos operativos son 60-70% menores que vehículos de gasolina (electricidad vs gasolina, mantenimiento mínimo). Catalizó inversiones superiores a $500 mil millones en infraestructura de carga global y gigafábricas de baterías. Todos los fabricantes automotrices tradicionales (GM, Ford, VW, BMW, Mercedes) han comprometido transiciones completas a vehículos eléctricos antes de 2035. Países como Noruega tienen más de 80% de ventas nuevas siendo EVs. Ha impulsado innovación masiva en baterías, electrónica de potencia, y materiales ligeros.",
    "images": ["", "", ""]
  },
  {
    "title": "Redes sociales (2004–actualidad)",
    "description": "Facebook, YouTube y Twitter transformaron la comunicación digital global y el análisis de datos, impulsando nuevas áreas en ingeniería de software y ciencia de datos.",
    "link": "https://es.wikipedia.org/wiki/Mark_Zuckerberg",
    "thumbnail": "/img/inventos/8.png",
    "creator": "Facebook (Mark Zuckerberg, 2004), YouTube (Jawed Karim, Steve Chen, Chad Hurley, 2005), Twitter (Jack Dorsey, 2006)",
    "creatorSlug": "mark-zuckerberg",
    "photo": "/img/inventores/markzuckerberg.jpg",
    "purpose": "Creadas para conectar a miles de millones de personas alrededor del mundo, facilitar el intercambio instantáneo de ideas, contenido multimedia y experiencias personales, y democratizar la comunicación global eliminando barreras geográficas, culturales y económicas. Facebook buscaba conectar inicialmente a estudiantes universitarios y expandirse a comunidades globales. YouTube democratizó la publicación de video, permitiendo que cualquier persona con una cámara pudiera transmitir su mensaje al mundo. Twitter revolucionó el microblogging y la comunicación en tiempo real de eventos globales. El objetivo fundamental era crear plataformas donde voces individuales pudieran alcanzar audiencias masivas sin intermediarios tradicionales como televisión o editoriales.",
    "additionalInfo": "Facebook alcanzó 3 mil millones de usuarios activos mensuales, convirtiéndose en la plataforma de comunicación más grande de la historia humana. YouTube procesa y almacena más de 500 horas de video por minuto, acumulando una biblioteca de contenido mayor que toda la televisión producida en la historia. TikTok alcanzó 1 mil millones de usuarios en solo 5 años mediante algoritmos de recomendación revolucionarios. Los algoritmos de machine learning analizan billones de interacciones para personalizar contenido específico para cada usuario individual. La infraestructura es masiva: Facebook utiliza más de 100,000 servidores distribuidos globalmente, procesa petabytes de datos diariamente, y almacena billones de fotos y videos. Las plataformas usan reconocimiento facial, procesamiento de lenguaje natural, moderación de contenido con IA, transmisión de video en vivo, realidad virtual (Meta Quest), y sistemas de publicidad hipersegmentada.",
    "impact": "Transformó radicalmente el periodismo (noticias en tiempo real, reporteros ciudadanos), marketing digital (publicidad dirigida por micro-segmentos), política (campañas directas a votantes, movilización), y activismo social global. Generó la economía de influencers y creadores de contenido valorada en $16+ mil millones anuales, permitiendo que millones de personas moneticen su creatividad. Facilitó movimientos sociales globales masivos como la Primavera Árabe, #MeToo, Black Lives Matter, organizados completamente en redes sociales. Sin embargo, creó desafíos significativos: crisis de privacidad de datos, desinformación viral, polarización política, impactos en salud mental (especialmente jóvenes), adicción digital, y debates sobre moderación de contenido y libertad de expresión. Impulsa innovación continua en IA, big data, análisis de sentimientos, y computación distribuida masiva.",
    "images": ["", "", ""]
  },
  {
    "title": "Big Data (2010–actualidad)",
    "description": "Conjunto de herramientas para procesar grandes volúmenes de datos en tiempo real. Fundamental para análisis predictivo, optimización industrial y automatización inteligente.",
    "link": "https://en.wikipedia.org/wiki/John_Mashey",
    "thumbnail": "/img/inventos/9.png",
    "creator": "Múltiples contribuidores: Google (MapReduce), Apache (Hadoop), Doug Cutting, John Mashey",
    "creatorSlug": "john-mashey",
    "photo": "/img/inventores/johnmashey.jpg",
    "purpose": "Desarrollado para manejar, almacenar, procesar y analizar volúmenes masivos de datos estructurados y no estructurados (petabytes, exabytes y más allá) que las bases de datos relacionales tradicionales simplemente no pueden procesar. El objetivo es extraer insights valiosos, patrones ocultos y conocimiento accionable de cantidades astronómicas de información generada por billones de sensores, dispositivos IoT, transacciones comerciales, interacciones en redes sociales, registros médicos y más. Big Data permite toma de decisiones basada en evidencia en tiempo real, predicción de tendencias futuras, optimización de procesos complejos, personalización masiva de servicios, y descubrimiento de relaciones causales imposibles de detectar manualmente.",
    "additionalInfo": "El concepto de Big Data se define por las 5 V's fundamentales: Volumen (escala masiva de datos), Velocidad (procesamiento y análisis en tiempo real), Variedad (datos estructurados, semi-estructurados y no estructurados), Veracidad (calidad, precisión y confiabilidad de los datos), y Valor (capacidad de extraer insights accionables). Tecnologías clave incluyen: Hadoop para almacenamiento distribuido, Apache Spark para procesamiento ultra-rápido en memoria, bases de datos NoSQL (MongoDB, Cassandra, HBase) para escalabilidad horizontal, cloud computing para recursos elásticos, machine learning para análisis predictivo, y data lakes para almacenar datos en formato nativo. El procesamiento distribuido y paralelo divide tareas masivas entre miles de servidores trabajando simultáneamente.",
    "impact": "Asombrosamente, más del 90% de todos los datos en existencia fueron creados en los últimos 2 años, generando zettabytes (trillones de gigabytes) de información. En retail, Amazon procesa más de 35 millones de transacciones diarias, personalizando recomendaciones para cientos de millones de usuarios. En salud, el análisis genómico y medicina personalizada utilizan Big Data para secuenciar genomas completos y diseñar tratamientos individualizados. Instituciones financieras detectan fraude en milisegundos analizando patrones en millones de transacciones simultáneas. Ciudades inteligentes optimizan tráfico, consumo energético, seguridad pública y servicios municipales mediante análisis en tiempo real. Creó el rol completamente nuevo del Data Scientist, una de las profesiones más demandadas y mejor pagadas del siglo XXI.",
    "images": ["", "", ""]
  },
  {
    "title": "Robots colaborativos (2012)",
    "description": "Robots industriales diseñados para trabajar junto a humanos sin barreras físicas. Combinan ingeniería mecánica, sensórica e inteligencia artificial.",
    "link": "https://en.wikipedia.org/wiki/Universal_Robots",
    "thumbnail": "/img/inventos/10.png",
    "creator": "Universal Robots (Esben Østergaard, Kasper Støy, Kristian Kassow)",
    "creatorSlug": "esben-ostergaard",
    "photo": "/img/inventores/esbenostergaard.jpg",
    "purpose": "Creados para automatizar tareas industriales repetitivas, monótonas, ergonómicamente peligrosas o que requieren precisión extrema, mientras trabajan de manera segura directamente junto a trabajadores humanos sin necesidad de jaulas de seguridad, barreras físicas o áreas restringidas. A diferencia de robots industriales tradicionales grandes y peligrosos, los cobots son fáciles de programar (incluso por personal sin formación en robótica mediante enseñanza por demostración), rápidos de reconfigurar para nuevas tareas, y diseñados para complementar capacidades humanas en lugar de reemplazar trabajadores completamente. El objetivo es democratizar la automatización para pequeñas y medianas empresas que no pueden justificar robots tradicionales costosos.",
    "additionalInfo": "Los cobots incorporan características revolucionarias de seguridad: sensores de fuerza y torque ultra-sensibles que detectan cualquier contacto o colisión instantáneamente y detienen el movimiento en milisegundos, diseño ligero con superficies redondeadas sin puntos de pellizco, y limitación de velocidad y fuerza. La programación es intuitiva mediante enseñanza por demostración (guiar físicamente el brazo robot), interfaces gráficas de arrastrar-y-soltar, o apps móviles. Rango de carga típico: 3-35 kg (suficiente para la mayoría de tareas). Los modelos modernos integran visión artificial para identificar objetos, machine learning para mejorar con la experiencia, conectividad IoT para monitoreo remoto, y compatibilidad con herramientas intercambiables (pinzas, ventosas, destornilladores, cámaras). El retorno de inversión (ROI) típico es de solo 6-12 meses, comparado con años para robots tradicionales.",
    "impact": "El mercado global de robots colaborativos alcanzó $1.8 mil millones en 2023 y crece más del 30% anualmente, siendo el segmento de más rápido crecimiento en robótica. Democratizó la automatización para pequeñas y medianas empresas que representan el 99% de las empresas globalmente. Aplicaciones incluyen: ensamblaje de precisión, soldadura, paletizado y empaque, control de calidad mediante inspección visual, atención médica (asistencia quirúrgica, rehabilitación), investigación de laboratorio, y servicio de alimentos. Ha logrado reducciones del 72% en lesiones laborales en tareas automatizadas (lesiones musculoesqueléticas, exposición a sustancias peligrosas). Crucialmente, complementa trabajadores humanos permitiéndoles enfocarse en tareas de mayor valor mientras el cobot maneja trabajos repetitivos, creando colaboración humano-robot en lugar de reemplazo.",
    "images": ["", "", ""]
  },
  {
    "title": "Cohetes reutilizables (2015)",
    "description": "Desarrollados por SpaceX, permiten reutilizar etapas de cohetes, reduciendo drásticamente costos y cambiando la ingeniería aeroespacial moderna.",
    "link": "https://es.wikipedia.org/wiki/Elon_Musk",
    "thumbnail": "/img/inventos/11.png",
    "creator": "SpaceX - Elon Musk y equipo de ingeniería aeroespacial",
    "creatorSlug": "elon-musk",
    "photo": "/img/inventores/elonmusk.webp",
    "purpose": "Desarrollados para reducir radicalmente (en órdenes de magnitud) el costo prohibitivo de acceso al espacio mediante la reutilización completa de cohetes espaciales en lugar del modelo tradicional de desecharlos después de cada lanzamiento, similar a tirar un avión Boeing 747 después de cada vuelo transatlántico. El objetivo visionario de Elon Musk y SpaceX es hacer la exploración espacial económicamente viable para aplicaciones comerciales masivas, hacer posible la eventual colonización de Marte y otros planetas, democratizar el acceso al espacio para universidades y pequeñas empresas, y establecer internet satelital global. La reutilización es absolutamente crítica para hacer estos objetivos realidad en lugar de fantasías de ciencia ficción.",
    "additionalInfo": "El Falcon 9 de SpaceX fue el primer cohete orbital completamente reutilizable que logró aterrizar exitosamente en 2015, un momento histórico en la ingeniería aeroespacial. Utiliza propulsión supersónica retropropulsiva (encender motores mientras desciende a velocidades supersónicas) para frenar y aterrizar verticalmente con precisión milimétrica en plataformas oceánicas o terrestres. Los boosters (primera etapa) pueden reutilizarse más de 15 veces con mantenimiento mínimo, algunos han volado 20+ veces. Starship, actualmente en desarrollo, está diseñado para reutilización completa 100+ veces (ambas etapas). La tecnología incluye: sistemas de guía autónomos con IA para aterrizajes precisos, aleaciones especiales de aluminio-litio resistentes al calor extremo, motores Merlin (Falcon 9) y Raptor (Starship) de metano-oxígeno líquido, patas de aterrizaje desplegables con amortiguación, y escudos térmicos cerámicos para reentrada atmosférica.",
    "impact": "Reducción revolucionaria de costos de lanzamiento de $65,000 por kilogramo a menos de $3,000/kg (95% de reducción), con Starship apuntando a menos de $100/kg. SpaceX ahora realiza aproximadamente el 70% de todos los lanzamientos orbitales globales, dominando completamente la industria. La constelación Starlink cuenta con más de 5,000 satélites brindando internet de alta velocidad a regiones remotas sin conectividad. Contratos superiores a $3 mil millones con NASA para misiones tripuladas a la Luna (programa Artemis) y la Estación Espacial Internacional. Inspiró competencia feroz: Blue Origin de Jeff Bezos, Rocket Lab, y otras empresas también desarrollan cohetes reutilizables. Ha democratizado el acceso al espacio para universidades, startups espaciales, y países sin programas espaciales propios.",
    "images": ["", "", ""]
  },
  {
    "title": "Baterías de estado sólido (2023–en desarrollo)",
    "description": "Tecnología de almacenamiento energético más segura y eficiente que las baterías de litio convencionales, con gran potencial en ingeniería eléctrica y automotriz.",
    "link": "https://en.wikipedia.org/wiki/John_B._Goodenough",
    "thumbnail": "/img/inventos/12.png",
    "creator": "John Goodenough",
    "creatorSlug": "john-goodenough",
    "photo": "/img/inventores/johngoodenough.jpg",
    "purpose": "Desarrolladas para superar completamente las limitaciones fundamentales y peligros de las baterías de ion-litio líquido convencionales: riesgo de incendio y explosión debido a electrolitos líquidos inflamables, degradación relativamente rápida, densidad energética limitada que restringe autonomía de vehículos eléctricos, velocidades de carga lentas (horas), y rendimiento pobre en temperaturas extremas. Las baterías de estado sólido representan el 'santo grial' de almacenamiento energético, prometiendo revolucionar completamente vehículos eléctricos (autonomías superiores a 800 km con cargas en minutos), aviación eléctrica, grid storage para energías renovables, y dispositivos electrónicos. El objetivo es crear baterías ultraseguras, ultra-densas, ultra-rápidas y ultra-duraderas.",
    "additionalInfo": "Las baterías de estado sólido reemplazan el electrolito líquido inflamable con un material sólido no combustible (cerámicas como LLZO, polímeros especiales, o vidrio sulfuro). Esto permite densidades energéticas de 400-900 Wh/kg comparado con 250 Wh/kg en ion-litio líquido (2-3.5x mejora), carga ultrarrápida del 0-80% en solo 10-15 minutos, vida útil extraordinaria equivalente a 1 millón de millas en vehículos eléctricos (vs 200,000-300,000 millas actuales), operación segura en rangos extremos de temperatura (-40°C a +100°C), y cero riesgo de incendio o explosión. Los desafíos técnicos incluyen: manufactura a escala industrial, costos de producción aún elevados, interfaces sólido-sólido problemáticas, y dendrita de litio que puede causar cortocircuitos. Empresas como Toyota, QuantumScape, Solid Power y Samsung invierten miles de millones.",
    "impact": "Los vehículos eléctricos equipados con baterías de estado sólido tendrán autonomías superiores a 800-1,000 kilómetros con una sola carga (comparable a vehículos de gasolina) y recarga completa en 10-15 minutos (similar a llenar un tanque de gasolina), eliminando completamente la 'ansiedad de autonomía'. La aviación eléctrica se volverá viable para vuelos regionales de 500+ km, revolucionando transporte aéreo de corta distancia. El almacenamiento de energía renovable (grid storage) será más eficiente y económico, permitiendo redes eléctricas 100% renovables. La producción comercial masiva está proyectada para 2025-2027. Inversiones globales superan los $20 mil millones en investigación, desarrollo y construcción de gigafábricas. Gobiernos consideran las baterías de estado sólido como tecnología estratégica nacional.",
    "images": ["", "", ""]
  },
  {
    "title": "GPS (Sistema de Posicionamiento Global) (2000–actualidad)",
    "description": "Sistema que usa satélites para saber nuestra posición exacta en la Tierra. Se usa en mapas, transporte y navegación en celulares. Ha mejorado la ingeniería en geolocalización y sistemas de navegación.",
    "link": "https://en.wikipedia.org/wiki/Roger_Easton",
    "thumbnail": "/img/inventos/13.png",
    "creator": "Roger L. Easton",
    "creatorSlug": "roger-easton",
    "photo": "/img/inventores/rogerleaston.jpg",
    "purpose": "Desarrollado originalmente como un proyecto militar ultra-secreto del Departamento de Defensa de EE.UU. para proporcionar navegación táctica precisa a fuerzas armadas en cualquier lugar del planeta y bajo cualquier condición climática, sin depender de referencias terrestres. Posteriormente fue liberado para uso civil gratuito con el objetivo de proporcionar navegación global precisa, revolucionar transporte terrestre, aéreo y marítimo, mejorar cartografía mundial, permitir agricultura de precisión para seguridad alimentaria, y habilitar servicios completamente nuevos basados en ubicación geográfica exacta. El GPS transformó la respuesta a emergencias, búsqueda y rescate, y sincronización crítica de tiempo para telecomunicaciones y servicios financieros globales.",
    "additionalInfo": "El sistema GPS consiste en una constelación de 31 satélites (24 operativos + 7 respaldo) orbitando a 20,200 kilómetros de altitud, completando dos órbitas completas cada 24 horas. La precisión para usuarios civiles es de 5-10 metros bajo cielo abierto, mientras que sistemas militares y DGPS (GPS diferencial) alcanzan precisión centimétrica. Funciona mediante trilateración: calculando la posición exacta basándose en el tiempo que tardan señales de radio de al menos 4 satélites en llegar al receptor. Sistemas complementarios globales incluyen: GLONASS (Rusia, 24 satélites), Galileo (Unión Europea, 30 satélites), BeiDou (China, 35 satélites). Los receptores modernos combinan múltiples sistemas (multi-GNSS) para mayor precisión y confiabilidad. Requiere línea de vista directa al cielo, limitándose en interiores, túneles y cañones urbanos.",
    "impact": "Más de 4 mil millones de dispositivos equipados con GPS operan globalmente (smartphones, vehículos, wearables, equipos industriales). La industria basada en GPS genera $280 mil millones anuales. Aplicaciones críticas transformadas: navegación aérea comercial (millones de vuelos anuales), navegación marítima (comercio global), servicios de emergencia 911 (localización automática de llamadas), agricultura de precisión (ahorro del 30% en agua y fertilizantes mediante aplicación dirigida), geología y sismología (monitoreo de placas tectónicas), mapas digitales (Google Maps, Apple Maps), apps de movilidad compartida (Uber, Lyft, Waze con 150+ millones de usuarios), logística global (rastreo de envíos en tiempo real), y deportes/fitness (tracking de rutas). Crucialmente, también sincroniza el tiempo en redes de telecomunicaciones, mercados financieros y redes eléctricas con precisión de nanosegundos.",
    "images": ["", "", ""]
  },
  {
    "title": "Drones civiles y comerciales (2010–presente)",
    "description": "Vehículos aéreos sin piloto controlados a distancia. Se usan para grabación, vigilancia, entregas y exploración en zonas difíciles. Han impulsado la ingeniería en robótica y sistemas de control.",
    "link": "https://en-wikipedia-org.translate.goog/wiki/Frank_Wang?_x_tr_sl=en&_x_tr_tl=es&_x_tr_hl=es&_x_tr_pto=tc",
    "thumbnail": "/img/inventos/14.png",
    "creator": "DJI (Frank Wang, 2006) popularizó drones civiles comercialmente",
    "creatorSlug": "frank-wang",
    "photo": "/img/inventores/frankwang.webp",
    "purpose": "Desarrollados para proporcionar plataformas aéreas ultra-accesibles, económicas y versátiles que democratizan completamente el acceso a perspectivas aéreas, capacidades de inspección, y recolección de datos desde el aire, anteriormente limitadas exclusivamente a helicópteros tripulados extremadamente costosos ($1,000+ por hora de vuelo) o aviones. Los objetivos incluyen: revolucionar fotografía y cinematografía aérea profesional y amateur, permitir inspecciones seguras de infraestructura peligrosa (puentes, torres, líneas eléctricas), optimizar agricultura mediante mapeo multiespectral, facilitar búsqueda y rescate en áreas inaccesibles, y eventualmente realizar entregas autónomas de paquetes pequeños. Frank Wang y DJI buscaban hacer drones tan fáciles de usar como smartphones.",
    "additionalInfo": "Los tipos principales incluyen: multirrotores como cuadricópteros (más comunes, maniobrabilidad superior), ala fija (autonomía larga pero requieren pistas), e híbridos VTOL. Tecnología clave: estabilización gimbal de 3 ejes para video ultra-suave, GPS/GLONASS dual para posicionamiento preciso, sensores de obstáculos omnidireccionales (ultrasonido, infrarrojos, visión estereoscópica), transmisión de video HD de baja latencia hasta 10+ km, baterías LiPo de alta densidad, controladores de vuelo con inteligencia artificial para estabilización automática y modos de vuelo inteligentes, y cámaras hasta 8K con sensores profesionales. Autonomía típica: 20-40 minutos dependiendo del modelo. Características avanzadas incluyen: seguimiento automático de sujetos, evitación activa de obstáculos, retorno automático a casa si pierde señal o batería baja, y vuelo waypoint programado.",
    "impact": "El mercado global de drones alcanzó $40 mil millones en 2023 con crecimiento exponencial continuo. En agricultura, el mapeo NDVI (índice de vegetación) identifica estrés en cultivos invisibles al ojo humano, mientras que drones fumigadores aplican pesticidas con precisión milimétrica (ahorrando 90% de químicos y agua). En construcción, inspecciones con drones y fotogrametría 3D generan modelos precisos de sitios, monitoreando progreso diario. La industria cinematográfica fue completamente transformada: tomas aéreas antes costosas ($10,000+) ahora cuestan cientos de dólares, democratizando producción cinematográfica. En búsqueda y rescate, drones equipados con cámaras térmicas salvan más de 500 vidas anuales localizando personas perdidas. Servicios de entrega emergentes: Amazon Prime Air, Zipline (suministros médicos urgentes en África y zonas rurales), Wing de Google. Las regulaciones aéreas continúan evolucionando (FAA en EE.UU., EASA en Europa) para integrar drones en espacio aéreo compartido.",
    "images": ["", "", ""]
  },
  {
    "title": "Realidad Virtual y Aumentada (2016–presente)",
    "description": "La realidad virtual es una tecnología que permite sumergir al usuario en un entorno digital mediante gafas o visores especiales. El usuario puede 'sentir' que está dentro de otro espacio, como una fábrica, un videojuego o una simulación de vuelo.",
    "link": "https://en.wikipedia.org/wiki/Palmer_Luckey",
    "thumbnail": "/img/inventos/15.png",
    "creator": "Oculus VR (Palmer Luckey, 2012, adquirida por Meta)",
    "creatorSlug": "palmer-luckey",
    "photo": "/img/inventores/palmerluckey.webp",
    "purpose": "Realidad Virtual (VR) busca crear experiencias inmersivas totalmente digitales que transporten usuarios a mundos completamente virtuales para gaming revolucionario, entrenamiento ultra-realista sin riesgos físicos, simulaciones médicas/militares, terapia psicológica, y entretenimiento experiencial. Realidad Aumentada (AR) busca superponer información digital contextualmente relevante, gráficos 3D, y datos en tiempo real sobre el mundo físico real, mejorando productividad industrial, educación práctica, navegación, y entretenimiento sin desconectar completamente del entorno físico. Palmer Luckey fundó Oculus para hacer VR finalmente accesible después de décadas de promesas incumplidas. El objetivo final es crear el 'metaverso': espacios virtuales persistentes donde trabajo, socialización y entretenimiento convergen.",
    "additionalInfo": "VR moderna incluye: pantallas OLED/LCD de ultra-alta resolución (4K+ por ojo, 8-12 megapíxeles totales), tracking 6DOF (seis grados de libertad) que rastrea posición y rotación en espacio 3D, audio espacial 3D que simula sonido direccional realista, refresh rates de 90-120Hz para eliminar mareo por movimiento, campo de visión de 90-120 grados (aproximándose a visión humana natural), y controles hand-tracking que eliminan necesidad de controladores. AR avanzada: Microsoft HoloLens proyecta hologramas 3D interactivos, Apple Vision Pro incorpora 23 millones de píxeles con displays micro-OLED, tracking ocular ultra-preciso para renderizado foveado, tracking de manos con machine learning, y transparencia pass-through de alta calidad. Realidad Mixta (MR) combina elementos de VR y AR, permitiendo objetos virtuales que interactúan con el entorno físico. Desafíos persistentes: mareo por movimiento (motion sickness), peso y comodidad de dispositivos, costo elevado ($300-$3,500), y contenido/aplicaciones limitadas.",
    "impact": "El mercado de VR/AR/MR alcanzó $30 mil millones en 2023, con proyecciones de superar $300 mil millones en 2030 a medida que la tecnología madura y costos disminuyen. En gaming, títulos como Half-Life: Alyx y Beat Saber ofrecen experiencias imposibles en pantallas tradicionales, creando presencia total. Para entrenamiento profesional, pilotos practican maniobras de emergencia, cirujanos ensayan operaciones complejas en gemelos digitales de pacientes reales, y militares simulan combate sin riesgo de vida. En educación, estudiantes toman tours virtuales inmersivos de civilizaciones antiguas, exploran el interior del cuerpo humano, o conducen experimentos en laboratorios virtuales sin químicos peligrosos. La industria utiliza VR/AR para: diseño colaborativo 3D de productos, visualización arquitectónica a escala real, y mantenimiento remoto guiado por expertos. Meta (Facebook) ha invertido más de $36 mil millones en desarrollo del metaverso, aunque su adopción masiva sigue siendo incierta.",
    "images": ["", "", ""]
  }
]
